Pandas-Working with Data Frames and Structures

In [1]:
import numpy as np
import pandas as pd

In [2]:
d={'Name':["Kasun","Kamal","Nimal","Sunil","Amal"],'Age':[23,24,25,26,27],'City':["Colombo","Kandy","Galle","Matara","Jaffna"]}
print(d)

{'Name': ['Kasun', 'Kamal', 'Nimal', 'Sunil', 'Amal'], 'Age': [23, 24, 25, 26, 27], 'City': ['Colombo', 'Kandy', 'Galle', 'Matara', 'Jaffna']}

In [4]:
df=pd.DataFrame(d)
print(df)

    Name  Age     City
0  Kasun   23  Colombo
1  Kamal   24    Kandy
2  Nimal   25    Galle
3  Sunil   26   Matara
4   Amal   27   Jaffna

In [32]:
fp=pd.read_csv('C:\\Users\\Tharindu\\Desktop\\Nibm HND\\10.ML\\iris.csv')
print(fp)

       Id  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0    1001           5.1          3.5           1.4          0.2     setosa
1    1002           4.9          3.0           1.4          0.2     setosa
2    1003           4.7          3.2           1.3          0.2     setosa
3    1004           4.6          3.1           1.5          0.2     setosa
4    1005           5.0          3.6           1.4          0.2     setosa
..    ...           ...          ...           ...          ...        ...
145  1146           6.7          3.0           5.2          2.3  virginica
146  1147           6.3          2.5           5.0          1.9  virginica
147  1148           6.5          3.0           5.2          2.0  virginica
148  1149           6.2          3.4           5.4          2.3  virginica
149  1150           5.9          3.0           5.1          1.8  virginica

[150 rows x 6 columns]

In [4]:
import pandas as pd
df2=pd.DataFrame({'Name':["Kasun","Kamal","Nimal","Sunil","Amal"],'Age':[23,24,25,26,27],'City':["Colombo","Kandy","Galle","Matara","Jaffna"]})
print(df2)
df2.to_csv('output.csv',index=False)#index=False remove the index column#save as csv file

df2.to_csv('output.xlsx',index=False)#save as excel file

    Name  Age     City
0  Kasun   23  Colombo
1  Kamal   24    Kandy
2  Nimal   25    Galle
3  Sunil   26   Matara
4   Amal   27   Jaffna

In [10]:
df2.iloc[1,2]#get the value of 1st row and 2nd column
df2.iloc[3,2]=20#change the value of 3rd row and 2nd column
df2.iloc[3,2]

20

In [11]:
df3=pd.DataFrame({'Name':["Kasun","Kamal","Nimal","Sunil","Amal"],'Age':[23,24,25,26,27]},index=['a','b','c','d','e'])
print(df3)
df3.drop('a')#drop the row a temporarily

    Name  Age
a  Kasun   23
b  Kamal   24
c  Nimal   25
d  Sunil   26
e   Amal   27

    Name  Age
b  Kamal   24
c  Nimal   25
d  Sunil   26
e   Amal   27

In [17]:

# df3.drop('a',inplace=True)                                        #drop the row a permanently
# df3.drop('Age',axis=1)                                        #drop the column Age temporarily
# df3.drop('Age',axis=1,inplace=True)                          #drop the column Age permanently
print(df3)

    Name  Age
b  Kamal   24
c  Nimal   25
d  Sunil   26
e   Amal   27

In [21]:
import numpy as np
df1 = pd.DataFrame(np.random.random((5, 2)), columns=['A', 'B'])  # create a dataframe with random values
df2 = pd.DataFrame(np.random.random((5, 2)), columns=['C', 'D'])
df3 = pd.DataFrame(np.random.random((5, 2)), columns=['E', 'F'])
print(df1)
print(df2)
print(df3)

          A         B
0  0.661408  0.565079
1  0.312636  0.830268
2  0.022648  0.140979
3  0.311498  0.585511
4  0.676748  0.178503
          C         D
0  0.937826  0.946352
1  0.361379  0.970622
2  0.740613  0.442946
3  0.048711  0.736434
4  0.600965  0.999260
          E         F
0  0.264631  0.066288
1  0.094038  0.823309
2  0.205344  0.212963
3  0.066272  0.359537
4  0.236817  0.837915

In [22]:
pd.concat([df1, df2],ignore_index=True)  # concatenate two dataframes with ignoring the index

          A         B         C         D
0  0.661408  0.565079       NaN       NaN
1  0.312636  0.830268       NaN       NaN
2  0.022648  0.140979       NaN       NaN
3  0.311498  0.585511       NaN       NaN
4  0.676748  0.178503       NaN       NaN
5       NaN       NaN  0.937826  0.946352
6       NaN       NaN  0.361379  0.970622
7       NaN       NaN  0.740613  0.442946
8       NaN       NaN  0.048711  0.736434
9       NaN       NaN  0.600965  0.999260

In [23]:
pd.concat([df1, df2], axis=1)  # concatenate two dataframes column wise

          A         B         C         D
0  0.661408  0.565079  0.937826  0.946352
1  0.312636  0.830268  0.361379  0.970622
2  0.022648  0.140979  0.740613  0.442946
3  0.311498  0.585511  0.048711  0.736434
4  0.676748  0.178503  0.600965  0.999260

In [34]:
pd.value_counts(fp['Species'])  # count the number of unique values in a column

C:\Users\Tharindu\AppData\Local\Temp\ipykernel_19672\2802478693.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(fp['Species'])  # count the number of unique values in a column

Species
setosa        50
versicolor    50
virginica     50
Name: count, dtype: int64

In [46]:
df5=pd.DataFrame({
                  'A':[1,2,7,4,5],
                    'B':[6,7,8,None,10],
                    'C':[11,12,None,14,15],
                    'D':[16,17,18,None,20]})
print(df5)

   A     B     C     D
0  1   6.0  11.0  16.0
1  2   7.0  12.0  17.0
2  7   8.0   NaN  18.0
3  4   NaN  14.0   NaN
4  5  10.0  15.0  20.0

In [47]:
print(df5.isnull())  # check for missing values

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False   True  False
3  False   True  False   True
4  False  False  False  False

In [48]:
totalnull=df5.isnull().sum().sum()  # count the total number of missing values
print(totalnull)

3

In [49]:
null_per_column=df5.isnull().sum()  # count the number of missing values in each column
print(null_per_column)

A    0
B    1
C    1
D    1
dtype: int64

In [52]:
df5.dropna()                    # drop drop rows with missing values temporarily
# df5.dropna(axis=1)                  # drop columns with missing values temporarily
# df5.dropna(thresh=3)                                 # drop rows with less than 3 non-missing values temporarily
# df5.dropna(subset=['A'])                    # drop rows with missing values in column A temporarily

   A     B     C     D
0  1   6.0  11.0  16.0
1  2   7.0  12.0  17.0
4  5  10.0  15.0  20.0

In [57]:
a=df5.fillna(10000)  # fill missing values with 0
print(a)

   A        B        C        D
0  1      6.0     11.0     16.0
1  2      7.0     12.0     17.0
2  7      8.0  10000.0     18.0
3  4  10000.0     14.0  10000.0
4  5     10.0     15.0     20.0

In [59]:
df_filled=df5.fillna(df5.mean())  # fill missing values with the mean of the column
print(df_filled)

   A      B     C      D
0  1   6.00  11.0  16.00
1  2   7.00  12.0  17.00
2  7   8.00  13.0  18.00
3  4   7.75  14.0  17.75
4  5  10.00  15.0  20.00

Filter and Modify existing Data

In [60]:
data={'Name':["Kasun","Kamal","Nimal","Sunil","Amal"],'Age':[23,24,25,26,27]}
df1=pd.DataFrame(data)
print(df1)

    Name  Age
0  Kasun   23
1  Kamal   24
2  Nimal   25
3  Sunil   26
4   Amal   27

In [63]:
filter1=df1[df1['Age']>24]  # filter rows where Age is greater than 24
print(filter1)

    Name  Age
2  Nimal   25
3  Sunil   26
4   Amal   27

In [64]:
df1['Name']=df1['Name'].str.upper()  # convert the Name column to uppercase
print(df1)
df1['Age']=df1['Age'].apply(lambda x:x+1)  # add 1 to each value in the Age column
print(df1)

    Name  Age
0  KASUN   23
1  KAMAL   24
2  NIMAL   25
3  SUNIL   26
4   AMAL   27
    Name  Age
0  KASUN   24
1  KAMAL   25
2  NIMAL   26
3  SUNIL   27
4   AMAL   28

In [65]:
list(df1.index)  # get the index of the dataframe

[0, 1, 2, 3, 4]

In [72]:
df1.reindex([5,0,3,2,1])  # change the order of the rows

    Name   Age
5    NaN   NaN
0  KASUN  24.0
3  SUNIL  27.0
2  NIMAL  26.0
1  KAMAL  25.0